<!doctype html>



  


<html class="theme-next muse use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    
    

  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.2" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="js," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.2" />






<meta name="description" content="&amp;#x5306;&amp;#x5306;&amp;#x8D70;&amp;#x8FC7;&amp;#x4E86;2016&amp;#xFF0C;&amp;#x65B0;&amp;#x7684;&amp;#x4E00;&amp;#x5E74;&amp;#x53C8;&amp;#x5F00;&amp;#x59CB;&amp;#x4E86;&amp;#x3002;&amp;#x65B0;&amp;#x5E74;&amp;#x6CA1;&amp;#x6709;&amp;#x4EC0;&amp;#x4E48;&amp;#x8BA1;&amp;#x5212;&amp;#xFF0C;&amp;#x5">
<meta property="og:type" content="article">
<meta property="og:title" content="移动端手势事件浅析">
<meta property="og:url" content="http://yoursite.com/2017/01/03/移动端手势事件浅析/index.html">
<meta property="og:site_name" content="暮歌">
<meta property="og:description" content="&amp;#x5306;&amp;#x5306;&amp;#x8D70;&amp;#x8FC7;&amp;#x4E86;2016&amp;#xFF0C;&amp;#x65B0;&amp;#x7684;&amp;#x4E00;&amp;#x5E74;&amp;#x53C8;&amp;#x5F00;&amp;#x59CB;&amp;#x4E86;&amp;#x3002;&amp;#x65B0;&amp;#x5E74;&amp;#x6CA1;&amp;#x6709;&amp;#x4EC0;&amp;#x4E48;&amp;#x8BA1;&amp;#x5212;&amp;#xFF0C;&amp;#x5">
<meta property="og:image" content="http://yoursite.com/2017/01/03/移动端手势事件浅析/qrcode.png">
<meta property="og:updated_time" content="2017-01-03T14:27:25.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="移动端手势事件浅析">
<meta name="twitter:description" content="&amp;#x5306;&amp;#x5306;&amp;#x8D70;&amp;#x8FC7;&amp;#x4E86;2016&amp;#xFF0C;&amp;#x65B0;&amp;#x7684;&amp;#x4E00;&amp;#x5E74;&amp;#x53C8;&amp;#x5F00;&amp;#x59CB;&amp;#x4E86;&amp;#x3002;&amp;#x65B0;&amp;#x5E74;&amp;#x6CA1;&amp;#x6709;&amp;#x4EC0;&amp;#x4E48;&amp;#x8BA1;&amp;#x5212;&amp;#xFF0C;&amp;#x5">
<meta name="twitter:image" content="http://yoursite.com/2017/01/03/移动端手势事件浅析/qrcode.png">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Muse',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://yoursite.com/2017/01/03/移动端手势事件浅析/"/>


  <title> 移动端手势事件浅析 | 暮歌 </title>
</head>

<body itemscope itemtype="//schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="//schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">暮歌</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">web前端技术分享</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup">
 <span class="search-icon fa fa-search"></span>
 <input type="text" id="local-search-input">
 <div id="local-search-result"></div>
 <span class="popup-btn-close">close</span>
</div>


    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="//schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                移动端手势事件浅析
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2017-01-03T22:20:37+08:00" content="2017-01-03">
              2017-01-03
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/技术/" itemprop="url" rel="index">
                    <span itemprop="name">技术</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2017/01/03/移动端手势事件浅析/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2017/01/03/移动端手势事件浅析/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          
             <span id="/2017/01/03/移动端手势事件浅析/" class="leancloud_visitors" data-flag-title="移动端手势事件浅析">
               &nbsp; | &nbsp;
               <span class="post-meta-item-icon">
                 <i class="fa fa-eye"></i>
               </span>
               <span class="post-meta-item-text">阅读次数 </span>
               <span class="leancloud-visitors-count"></span>
              </span>
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p><strong>&#x5306;</strong>&#x5306;&#x8D70;&#x8FC7;&#x4E86;2016&#xFF0C;&#x65B0;&#x7684;&#x4E00;&#x5E74;&#x53C8;&#x5F00;&#x59CB;&#x4E86;&#x3002;&#x65B0;&#x5E74;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x8BA1;&#x5212;&#xFF0C;&#x56E0;&#x4E3A;&#x5F80;&#x5E74;&#x6B20;&#x4E86;&#x592A;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x8FB9;&#x8D70;&#x8FB9;&#x770B;&#x5427;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x65B0;&#x5E74;&#x7B2C;&#x4E00;&#x5929;&#x552F;&#x4E00;&#x503C;&#x5F97;&#x8BF4;&#x7684;&#x4E8B;&#x5C31;&#x662F;&#x9F13;&#x8DB3;&#x4E86;&#x52C7;&#x6C14;&#x4E3B;&#x52A8;&#x53BB;&#x8BA4;&#x8BC6;&#x4E86;&#x4E00;&#x4E2A;&#x7F8E;&#x5973;&#xFF08;&#x7531;&#x4E8E;&#x672C;&#x4EBA;&#x5B9E;&#x5728;&#x592A;&#x5185;&#x5411;&#xFF0C;&#x4EE5;&#x5F80;&#x57FA;&#x672C;&#x6CA1;&#x8FD9;&#x6837;&#x505A;&#x8FC7;&#xFF09;&#xFF0C;&#x4E5F;&#x7B97;&#x662F;&#x81EA;&#x6211;&#x7A81;&#x7834;&#x4E00;&#x4E0B;&#x5427;&#x3002;<br>&#x4E4B;&#x524D;&#x6709;&#x4E2A;&#x670B;&#x53CB;&#x95EE;&#x8FC7;&#x4E00;&#x5173;&#x4E8E;&#x79FB;&#x52A8;&#x7AEF;&#x957F;&#x6309;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E3A;&#x4E86;&#x5E94;&#x6025;&#x5C31;&#x7ED9;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x4E11;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x51D1;&#x5408;&#x7740;&#x628A;&#x529F;&#x80FD;&#x505A;&#x4E86;&#xFF0C;&#x4E4B;&#x540E;&#x4E00;&#x76F4;&#x60F3;&#x6574;&#x7406;&#x4E00;&#x4E0B;&#x5173;&#x4E8E;&#x79FB;&#x52A8;&#x7AEF;&#x7684;&#x624B;&#x52BF;&#x64CD;&#x4F5C;&#xFF0C;&#x4E5F;&#x4E00;&#x76F4;&#x6CA1;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x662F;&#x5143;&#x65E6;&#x5C0F;&#x957F;&#x5047;&#xFF0C;&#x8FD9;&#x79CD;&#x4E13;&#x95E8;&#x7ED9;&#x6211;&#x8FD9;&#x79CD;&#x5E74;&#x8F7B;&#x5C4C;&#x4E1D;&#x51AC;&#x7720;&#x7684;&#x5047;&#x671F;&#xFF0C;&#x6211;&#x5374;&#x7528;&#x5B83;&#x6765;&#x5199;&#x4E86;&#x8FD9;&#x7BC7;&#x535A;&#x5BA2;&#xFF0C;&#x771F;&#x662F;&#x7F6A;&#x8FC7;&#x3002;&#x8FD9;&#x7BC7;&#x535A;&#x5BA2;&#x5F00;&#x5199;&#x4E4B;&#x524D;&#x6211;&#x5148;&#x53BB;&#x505A;&#x4E86;&#x4E2A;&#x5404;&#x79CD;&#x624B;&#x52BF;&#x64CD;&#x4F5C;&#x7684;demo,&#x5F53;&#x7136;&#xFF0C;&#x4E3B;&#x8981;&#x53C2;&#x8003;&#x4E86;<strong>&#x9E45;&#x5382;</strong>&#x4E00;&#x4E2A;&#x524D;&#x7AEF;&#x56E2;&#x961F;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x6574;&#x4E2A;demo&#x505A;&#x7684;&#x6211;&#x5404;&#x79CD;&#x86CB;&#x75BC;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x5728;&#x4F4F;&#x5904;&#x95F7;&#x4E86;&#x592A;&#x4E45;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x6362;&#x4E86;&#x4E2A;mac&#x5199;&#x4EE3;&#x7801;&#x5404;&#x79CD;&#x4E0D;&#x9002;&#x5E94;&#xFF0C;&#x5BFC;&#x81F4;&#x5FC3;&#x7406;&#x5F88;&#x6025;&#x8E81;&#xFF0C;&#x62D6;&#x4E86;&#x6BD4;&#x8F83;&#x4E45;&#x624D;&#x5199;&#x5B8C;demo,&#x53EF;&#x4EE5;<strong><a href="http://sadrun.duapp.com/demo/finger/finger.html" target="_blank" rel="external">&#x731B;&#x6413;&#x8FD9;&#x91CC;</a></strong>&#x770B;&#x6548;&#x679C;&#xFF0C;&#x5F53;&#x7136;&#x5EFA;&#x8BAE;&#x6700;&#x597D;&#x7528;&#x5FAE;&#x4FE1;&#x4E4B;&#x7C7B;&#x7684;&#x626B;&#x4E00;&#x626B;&#x4E0B;&#x9762;&#x4E8C;&#x7EF4;&#x7801;&#xFF08;&#x522B;&#x7528;qq&#x626B;&#xFF0C;&#x56E0;&#x4E3A;qq&#x5BF9;&#x4F7F;&#x7528;&#x767E;&#x5EA6;bae&#x4E8C;&#x7EA7;&#x57DF;&#x540D;&#x7684;&#x8FD9;&#x7C7B;&#x7F51;&#x7AD9;&#x4F1A;&#x663E;&#x793A;&#x6210;&#x5371;&#x9669;&#x7F51;&#x7AD9;&#xFF0C;&#x6253;&#x4E0D;&#x5F00;&#xFF09;&#xFF0C;&#x76F4;&#x63A5;&#x5728;&#x624B;&#x673A;&#x770B;&#x6548;&#x679C;&#x597D;&#x70B9;&#xFF0C;pc&#x624B;&#x673A;&#x6A21;&#x62DF;&#x6A21;&#x5F0F;&#x6709;&#x4E9B;&#x624B;&#x52BF;&#x6548;&#x679C;&#x6CA1;&#x6CD5;&#x641E;&#x3002;<br><img src="/2017/01/03/&#x79FB;&#x52A8;&#x7AEF;&#x624B;&#x52BF;&#x4E8B;&#x4EF6;&#x6D45;&#x6790;/qrcode.png" alt=""><br>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x5C31;&#x8FDB;&#x5165;&#x6B63;&#x9898;&#xFF0C;&#x6765;&#x804A;&#x804A;<strong>&#x79FB;&#x52A8;&#x7AEF;&#x624B;&#x52BF;</strong>&#x64CD;&#x4F5C;&#x3002;&#x79FB;&#x52A8;&#x7AEF;&#x5404;&#x79CD;&#x624B;&#x52BF;&#x64CD;&#x4F5C;&#x7F51;&#x4E0A;&#x67E5;&#x4E86;&#x4E0B;&#xFF0C;&#x591A;&#x7684;&#x8981;&#x6B7B;&#xFF0C;&#x4E94;&#x82B1;&#x516B;&#x95E8;&#x7684;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x672C;&#x7740;&#x5B9E;&#x7528;&#x4E3B;&#x4E49;&#x7CBE;&#x795E;&#x6765;&#x8BF4;&#x8BF4;&#x5176;&#x4E2D;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x89C1;&#x7684;&#x4E00;&#x4E9B;&#x624B;&#x52BF;&#xFF0C;&#x5206;&#x522B;&#x662F;&#x957F;&#x6309;(longTap)&#xFF0C;&#x70B9;&#x51FB;(singleTap)&#xFF0C;&#x65CB;&#x8F6C;(rotate)&#xFF0C;&#x653E;&#x5927;&#xFF0F;&#x7F29;&#x5C0F;&#xFF08;scale&#xFF09;&#xFF0C;&#x6ED1;&#x52A8;(swipe)&#xFF0C;&#x53CC;&#x51FB;(doubleTap)&#xFF0C;&#x62D6;&#x52A8;&#xFF08;drop&#xFF09;&#xFF0C;&#x4EE5;&#x4E0A;&#x8FD9;&#x4E9B;&#x6211;&#x60F3;&#x5927;&#x5BB6;&#x90FD;&#x4E0D;&#x964C;&#x751F;&#x5427;&#xFF0C;&#x968F;&#x4FBF;&#x4E00;&#x4E2A;app&#x90FD;&#x4F1A;&#x6709;&#x5982;&#x4E0A;&#x64CD;&#x4F5C;&#x3002;&#x518D;&#x4ED4;&#x7EC6;&#x8BB2;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x6765;&#x518D;&#x6765;&#x70B9;&#x751C;&#x70B9;&#xFF0C;&#x4E5F;&#x662F;&#x5728;&#x524D;&#x6587;&#x7AE0;&#x4E2D;&#x63D0;&#x5230;&#x8FC7;&#x7684;&#xFF0C;&#x5BF9;&#x524D;&#x7AEF;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x6574;&#x4E2A;&#x79FB;&#x52A8;&#x7AEF;&#x624B;&#x52BF;&#x64CD;&#x4F5C;&#x90FD;&#x57FA;&#x4E8E;&#x4E09;&#x4E2A;&#x6700;&#x57FA;&#x672C;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5373;touchstart&#xFF0C;touchmove,touchend&#x3002;&#x4E09;&#x8005;&#x7F3A;&#x4E00;&#x4E0D;&#x53EF;&#xFF0C;&#x5F53;&#x7136;&#x5C31;&#x8FD9;&#x4E09;&#x5206;&#x5730;&#xFF0C;&#x4E5F;&#x6CA1;&#x6CD5;&#x7F3A;&#x8AB0;&#x3002;&#x7136;&#x540E;&#x57FA;&#x4E8E;&#x4E0A;&#x9762;&#x4E2A;&#x4E09;&#x64CD;&#x4F5C;&#xFF0C;&#x6211;&#x4EEC;&#x6839;&#x636E;&#x7528;&#x6237;&#x64CD;&#x4F5C;&#x4E60;&#x60EF;&#xFF0C;&#x53C8;&#x62BD;&#x8C61;&#x5206;&#x79BB;&#x51FA;&#x6765;&#x4E86;&#x5176;&#x4ED6;&#x5404;&#x79CD;&#x64CD;&#x4F5C;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x5C31;&#x6765;&#x9010;&#x4E2A;&#x5206;&#x6790;&#x5E38;&#x89C1;&#x624B;&#x52BF;&#x3002;<a id="more"></a>&#xFF08;</p>
<p>##&#x957F;&#x6309;(longTap)<br>&#x5728;&#x67D0;&#x4E9B;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x957F;&#x6309;&#x67D0;&#x4E2A;&#x5143;&#x7D20;&#x6765;&#x5B9E;&#x73B0;&#x67D0;&#x4E9B;&#x529F;&#x80FD;&#xFF0C;&#x4F8B;&#x5982;&#x9009;&#x4E2D;&#x6216;&#x8005;&#x8C03;&#x7528;&#x5F39;&#x51FA;&#x5C42;&#x4E4B;&#x7C7B;&#x7684;&#x3002;&#x957F;&#x6309;&#x548C;&#x76F4;&#x63A5;&#x5355;&#x70B9;&#x7684;&#x533A;&#x522B;&#x6211;&#x4E2A;&#x4EBA;&#x89C9;&#x524D;&#x8005;&#x662F;&#x5728;&#x7528;&#x6237;&#x975E;&#x5E38;&#x80AF;&#x5B9A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x89E6;&#x53D1;&#x4E00;&#x4E9B;&#x60F3;&#x8981;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x76EE;&#x7684;&#x6027;&#x4F1A;&#x6BD4;&#x8F83;&#x660E;&#x786E;&#xFF0C;&#x540E;&#x8005;&#x53EF;&#x80FD;&#x662F;&#x4ECE;&#x7528;&#x6237;&#x4E60;&#x60EF;&#x6765;&#x8003;&#x8651;&#x7684;&#xFF08;&#x4E2A;&#x4EBA;&#x8BA4;&#x8BC6;&#xFF09;&#x3002;&#x8FD9;&#x79CD;&#x7528;&#x6237;&#x5206;&#x6790;&#x6211;&#x5C31;&#x4E0D;&#x626F;&#x4E86;&#xFF0C;&#x8FD8;&#x662F;&#x6765;&#x626F;&#x6B63;&#x9898;&#xFF0C;&#x8981;&#x600E;&#x4E48;&#x7528;&#x6211;&#x4EEC;&#x7684;touch&#x5BB6;&#x65CF;&#x4E09;&#x5144;&#x5F1F;&#x6765;&#x5B9E;&#x73B0;&#x5462;&#xFF1F;&#x60F3;&#x60F3;&#x8FD8;&#x662F;&#x5F88;&#x7B80;&#x5355;&#x7684;&#xFF0C;<strong>&#x957F;&#x6309;</strong>&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x5C31;&#x662F;&#x624B;&#x6307;&#x957F;&#x65F6;&#x95F4;&#x505C;&#x7559;&#x5728;&#x5143;&#x7D20;&#x4E0A;<strong>&#x4E0D;&#x52A8;</strong>&#xFF0C;&#x76F4;&#x5230;&#x5728;&#x6211;&#x4EEC;<strong>&#x9884;&#x5148;&#x8BBE;&#x5B9A;</strong>&#x7684;&#x65F6;&#x95F4;&#x70B9;&#x89E6;&#x53D1;&#x6211;&#x4EEC;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#x4E3A;&#x6B62;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x957F;&#x6309;&#x64CD;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x9884;&#x5148;&#x8BBE;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#x8981;&#x5728;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5462;&#xFF1F;&#x8FD9;&#x4E2A;&#x561B;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x53EA;&#x8981;&#x6761;&#x4EF6;&#x5141;&#x8BB8;&#xFF0C;&#x4F60;&#x6309;&#x4E2A;&#x4E00;&#x4E24;&#x5929;&#x89E6;&#x53D1;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x524D;&#x63D0;&#x662F;&#x4E0D;&#x6015;&#x88AB;&#x4EA7;&#x54C1;&#x6253;&#x6B7B;&#x3002;&#x5B89;&#x5168;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x6BD4;&#x8F83;&#x901A;&#x7528;&#x7684;750ms&#x5DE6;&#x53F3;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x4F5C;&#x4E3A;&#x957F;&#x6309;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#x7684;&#x89E6;&#x53D1;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x6837;&#x7A0D;&#x5FAE;&#x4EBA;&#x6027;&#x5316;&#x4E00;&#x70B9;&#x3002;&#x4E0B;&#x9762;&#x5C31;&#x5230;&#x4E86;&#x94FA;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#xFF1A;</p>
<pre><code>target.addEventListener(&apos;touchstart&apos;,function(e){
    //&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5B9A;&#x65F6;&#x5668;&#xFF0C;&#x5728;750ms&#x4E4B;&#x540E;&#x89E6;&#x53D1;&#x957F;&#x6309;&#x4E8B;&#x4EF6;
    longTapTimer = setTimeout(function(){
        longTap(e);//&#x957F;&#x6309;&#x4E8B;&#x4EF6;&#x81EA;&#x5B9A;&#x4E49;&#x56DE;&#x8C03;&#x51FD;&#x6570;
    },750)
},false);
target.addEventListener(&apos;touchmove&apos;,function(e){
    //&#x5982;&#x679C;&#x624B;&#x6307;&#x79FB;&#x52A8;&#xFF0C;&#x5219;&#x7ACB;&#x9A6C;&#x53D6;&#x6D88;&#x957F;&#x6309;&#x5B9A;&#x65F6;&#x5668;&#xFF0C;&#x89C6;&#x4E3A;&#x975E;&#x957F;&#x6309;&#x64CD;&#x4F5C;
    clearTimeout(longTapTimer);
},false);
target.addEventListener(&apos;touchend&apos;,function(e){
    //&#x5982;&#x679C;&#x624B;&#x6307;&#x62AC;&#x8D77;&#xFF0C;&#x5219;&#x7ACB;&#x9A6C;&#x53D6;&#x6D88;&#x957F;&#x6309;&#x5B9A;&#x65F6;&#x5668;
    clearTimeout(longTapTimer);
},false);
</code></pre><p>&#x4E0A;&#x9762;&#x4E09;&#x6B65;&#x6BD4;&#x8F83;&#x660E;&#x4E86;&#x4E86;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x6700;&#x540E;&#x4E00;&#x6B65;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x624B;&#x6307;&#x62AC;&#x8D77;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x8FD8;&#x6CA1;&#x6709;&#x89E6;&#x53D1;&#x6211;&#x4EEC;&#x9884;&#x5148;&#x5B9A;&#x4E49;&#x7684;&#x957F;&#x6309;&#x4E8B;&#x4EF6;&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x5F53;&#x7ACB;&#x5373;&#x6E05;&#x9664;&#x6389;&#xFF0C;&#x56E0;&#x4E3A;&#x6B64;&#x523B;&#x6216;&#x8005;&#x6B64;&#x523B;&#x4E4B;&#x524D;&#x5982;&#x679C;&#x6CA1;&#x89E6;&#x53D1;&#xFF0C;&#x90A3;&#x5B83;&#x4E4B;&#x540E;&#x4E5F;&#x6CA1;&#x6709;&#x89E6;&#x53D1;&#x7684;&#x5FC5;&#x8981;&#x4E86;&#x3002;</p>
<p>##&#x70B9;&#x51FB;(singleTap)<br>&#x70B9;&#x51FB;&#x64CD;&#x4F5C;&#x5C31;&#x6BD4;&#x8F83;&#x5355;&#x7EAF;&#x4E86;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x624B;&#x6307;&#x6309;&#x5728;&#x5143;&#x7D20;&#x5230;&#x62AC;&#x8D77;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x79FB;&#x52A8;&#x6216;&#x8005;&#x79FB;&#x52A8;&#x7684;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x5F88;&#x660E;&#x663E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5219;&#x5C31;&#x89C6;&#x4E3A;&#x70B9;&#x51FB;&#x3002;&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x53C8;&#x6765;&#x4E86;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x201C;&#x79FB;&#x52A8;&#x4E0D;&#x662F;&#x5F88;&#x660E;&#x663E;&#x201D;&#xFF0C;&#x8FD9;&#x4E2A;&#x561B;&#xFF0C;&#x4F60;&#x61C2;&#x5F97;&#xFF0C;&#x5C31;&#x770B;&#x4EA7;&#x54C1;&#x7684;&#x7231;&#x597D;&#x4E86;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x6309;&#x7167;&#x5B89;&#x5168;&#x6570;&#x503C;&#x6765;&#x505A;&#xFF0C;&#x5373;&#x5C31;&#x662F;&#x4E0A;&#x4E0B;&#x5DE6;&#x53F3;&#x79FB;&#x52A8;&#x8DDD;&#x79BB;&#x4E0D;&#x8D85;&#x8FC7;30&#x4E2A;&#x50CF;&#x7D20;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x8BA4;&#x4E3A;&#x662F;&#x666E;&#x901A;&#x70B9;&#x51FB;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x4E24;&#x79CD;&#x70B9;&#x51FB;&#x6548;&#x679C;&#xFF0C;&#x4E00;&#x79CD;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5728;pc&#x7AEF;&#x90A3;&#x79CD;&#xFF0C;&#x6BD4;&#x666E;&#x901A;&#x89E6;&#x6478;&#x65F6;&#x95F4;&#x6162;&#x4E2A;200&#x591A;&#x8C6A;&#x79D2;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x5C31;&#x662F;&#x62AC;&#x8D77;&#x624B;&#x6307;&#x65F6;&#x89E6;&#x53D1;&#x7684;&#x70B9;&#x51FB;&#xFF0C;&#x8FD9;&#x4E2A;&#x6BD4;&#x666E;&#x901A;&#x7684;&#x5FEB;&#x90A3;&#x4E48;200&#x591A;&#x8C6A;&#x79D2;&#x3002;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>target.addEventListener(&apos;touchend&apos;,function(e){
    //&#x5982;&#x679C;&#x79FB;&#x52A8;&#x8DDD;&#x79BB;&#x5C0F;&#x4E8E;30&#x50CF;&#x7D20;&#xFF0C;&#x5219;&#x89E6;&#x53D1;.&#x5047;&#x8BBE;&#x6C34;&#x5E73;&#x548C;&#x7AD6;&#x76F4;&#x79FB;&#x52A8;&#x8DDD;&#x79BB;&#x5206;&#x522B;&#x4E3A;L1,L2;
    if(L1 &lt; 30 &amp;&amp; L2 &lt; 30){
        tap(e); //&#x79FB;&#x52A8;&#x7AEF;&#x6807;&#x51C6;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;
        singleTapTimer = setTimeout(function(){
            singleTap(e);//&#x5355;&#x70B9;&#x81EA;&#x5B9A;&#x4E49;&#x56DE;&#x8C03;&#xFF0C;&#x63A5;&#x8FD1;&#x4E8E;click&#x4E8B;&#x4EF6;
        },250)
    }
},false);
</code></pre><p>&#x4E0A;&#x9762;&#x4EE3;&#x7801;&#x6CA1;&#x6709;&#x5BF9;&#x53CC;&#x51FB;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x666E;&#x901A;&#x70B9;&#x51FB;&#x5931;&#x6548;&#x505A;&#x5904;&#x7406;&#x3002;&#x8FD9;&#x4E2A;&#x540E;&#x9762;&#x518D;&#x8BF4;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x70B9;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x5373;&#x5C31;&#x662F;&#x6C34;&#x5E73;&#x548C;&#x5782;&#x76F4;&#x79FB;&#x52A8;&#x8DDD;&#x79BB;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x8981;&#x8BB0;&#x4F4F;&#x662F;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x624B;&#x6307;&#x4F4D;&#x7F6E;&#x548C;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x7684;&#x524D;&#x4E00;&#x6B21;&#x7684;&#x4F4D;&#x7F6E;&#x7684;&#x5DEE;&#x503C;&#x3002;</p>
<p>##&#x53CC;&#x51FB;(doubleTap)<br>&#x53CC;&#x51FB;&#x4E8B;&#x4EF6;&#x5C31;&#x662F;&#x666E;&#x901A;&#x70B9;&#x51FB;&#x7684;&#x53E0;&#x52A0;&#xFF0C;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x5C31;&#x662F;&#x53CC;&#x51FB;&#x67D0;&#x4E2A;&#x56FE;&#x7247;&#x653E;&#x5927;&#x7684;&#x529F;&#x80FD;&#x3002;&#x5176;&#x89E6;&#x53D1;&#x6761;&#x4EF6;&#x4E3A;&#x666E;&#x901A;&#x70B9;&#x51FB;&#x89E6;&#x53D1;&#x4E4B;&#x524D;&#xFF0C;&#x8FDE;&#x7EED;&#x4E24;&#x6B21;&#x70B9;&#x51FB;&#xFF0C;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x666E;&#x901A;&#x70B9;&#x51FB;&#x8BBE;&#x7F6E;&#x7684;&#x51FA;&#x53D1;&#x65F6;&#x95F4;&#x4E3A;250ms,&#x4E8E;&#x662F;&#x5F53;&#x4E24;&#x6B21;&#x70B9;&#x51FB;&#x65F6;&#x95F4;&#x5C0F;&#x4E8E;250ms&#x65F6;&#x6211;&#x4EEC;&#x89E6;&#x53D1;&#x53CC;&#x51FB;&#x4E8B;&#x4EF6;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x6E05;&#x9664;&#x6389;&#x666E;&#x901A;&#x5355;&#x51FB;&#x4E8B;&#x4EF6;&#x3002;&#x5B9E;&#x73B0;&#x5982;&#x4E0B;</p>
<pre><code>target.addEventListener(&apos;touchstart&apos;,function(e){
    //&#x5148;&#x5224;&#x65AD;&#x5F53;&#x524D;&#x70B9;&#x51FB;&#x65F6;&#x95F4;&#x548C;&#x4E0A;&#x6B21;&#x70B9;&#x51FB;&#x65F6;&#x95F4;&#x5DEE;&#x662F;&#x5426;&#x5728;&#x6211;&#x4EEC;&#x9884;&#x5148;&#x5B9A;&#x4E49;&#x7684;250ms&#x4E4B;&#x5185;,&#x5047;&#x8BBE;&#x65F6;&#x95F4;&#x5DEE;&#x4E3A;&#xFF1A;delta&#xFF1B;
    if(delta &lt;= 250){
        isDoubleTap = true;//&#x6B64;&#x65F6;&#x662F;&#x5426;&#x4E3A;&#x53CC;&#x51FB;&#x7684;&#x72B6;&#x6001;&#x8BBE;&#x4E3A;true,&#x8868;&#x793A;&#x6EE1;&#x8DB3;&#x53CC;&#x51FB;&#x6761;&#x4EF6;
    }
},false);
target.addEventListener(&apos;touchend&apos;,function(e){
    //&#x5728;&#x5141;&#x8BB8;&#x89E6;&#x53D1;&#x7684;&#x8303;&#x56F4;&#x5185;&#x89E6;&#x53D1;&#x53CC;&#x51FB;&#x4E8B;&#x4EF6;
   if(L1 &lt; 30 &amp;&amp; L2 &lt; 30 &amp;&amp; isDoubleTap){
        clearTimeout(singleTapTimer);
       doubleTap(e);//&#x53CC;&#x51FB;&#x81EA;&#x5B9A;&#x4E49;&#x56DE;&#x8C03;
       isDoubleTap = false;//&#x5C06;&#x72B6;&#x6001;&#x8BBE;&#x4E3A;&#x521D;&#x59CB;&#x7684;&#x72B6;&#x6001;
    }
},false);
</code></pre><p>&#x53CC;&#x51FB;&#x53EA;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x4E00;&#x70B9;&#xFF0C;&#x5728;&#x89E6;&#x53D1;&#x7684;&#x65F6;&#x5019;&#x9700;&#x8981;&#x4E00;&#x5B9A;&#x8981;&#x628A;&#x666E;&#x901A;&#x5355;&#x51FB;&#x7ED9;clear&#x6389;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x8BB2;&#x662F;&#x6C34;&#x706B;&#x4E0D;&#x5BB9;&#x7684;&#x3002;</p>
<p>##&#x65CB;&#x8F6C;(rotate)<br>&#x65CB;&#x8F6C;&#x5176;&#x5B9E;&#x7B97;&#x662F;&#x5E38;&#x7528;&#x4E8B;&#x4EF6;&#x4E2D;&#x8F83;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x91CC;&#x9762;&#x7275;&#x6D89;&#x5230;&#x5F88;&#x591A;&#x6570;&#x5B66;&#x77E5;&#x8BC6;&#xFF0C;&#x5F53;&#x7136;&#x53EA;&#x8981;&#x4F60;&#x4E0A;&#x8FC7;&#x9AD8;&#x4E2D;&#xFF0C;&#x5E94;&#x8BE5;&#x90FD;&#x4F1A;&#x3002;&#x9996;&#x5148;&#x6765;&#x5206;&#x6790;&#x4E0B;&#x65CB;&#x8F6C;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x65CB;&#x8F6C;&#x67D0;&#x4E2A;&#x5143;&#x7D20;&#x65F6;&#xFF0C;&#x9996;&#x5148;&#x4E24;&#x624B;&#x6307;&#x6309;&#x4F4F;&#x5143;&#x7D20;&#xFF0C;&#x7136;&#x540E;&#x4EE5;&#x4E00;&#x5B9A;&#x5F27;&#x5EA6;&#x5427;&#x5143;&#x7D20;&#x65CB;&#x8F6C;&#x5230;&#x60F3;&#x8981;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x4F1A;&#x89E6;&#x53D1;touchmove&#x4E8B;&#x4EF6;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x5B9E;&#x65F6;&#x8BB0;&#x5F55;&#x5F53;&#x524D;&#x548C;&#x4E4B;&#x524D;&#x4E00;&#x6B21;&#x4E24;&#x624B;&#x6307;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x6BCF;&#x4E00;&#x6B21;touchmove&#x4E8B;&#x4EF6;&#x89E6;&#x53D1;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x4E24;&#x6B21;&#x7684;&#x4F4D;&#x7F6E;&#x6765;&#x8BA1;&#x7B97;&#x65CB;&#x8F6C;&#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x7136;&#x540E;&#x8C03;&#x7528;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x6BCF;&#x6B21;&#x7684;&#x89D2;&#x5EA6;&#x5462;&#xFF0C;&#x8FD9;&#x65F6;&#x8BE5;&#x4E07;&#x80FD;&#x7684;&#x6570;&#x5B66;&#x767B;&#x573A;&#x4E86;&#xFF0C;&#x8BDD;&#x4E0D;&#x591A;&#x8BF4;&#xFF0C;&#x4E00;&#x56FE;&#x80DC;&#x5343;&#x8A00;&#xFF0C;&#x6162;&#x6162;&#x4F53;&#x4F1A;&#x4E0B;&#xFF1A;<br><a href="rotate.png"></a><br>&#x5B9E;&#x5728;&#x627E;&#x4E0D;&#x5230;&#x4EC0;&#x4E48;&#x597D;&#x7684;&#x753B;&#x56FE;&#x5DE5;&#x5177;&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x7528;word&#x51D1;&#x5408;&#x4E86;&#xFF0C;&#x753B;&#x5B8C;&#x6B64;&#x56FE;&#xFF0C;&#x6211;&#x611F;&#x89C9;&#x6211;&#x6570;&#x5B66;&#x59FF;&#x52BF;&#x53C8;&#x6DA8;&#x4E86;&#x4E0D;&#x5C11;&#x3002;&#x56FE;&#x4E2D;&#x4E0A;&#x534A;&#x90E8;&#x5206;&#x4E3A;&#x5B9E;&#x9645;&#x62BD;&#x8C61;&#x793A;&#x610F;&#x56FE;&#xFF0C;AB&#x548C;A&#x2019;B&#x2019;&#x5206;&#x522B;&#x4EE3;&#x8868;&#x4E86;&#x4E24;&#x6B21;&#x624B;&#x6307;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;<strong>&#x3B8;</strong>&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x5C31;&#x6211;&#x4EEC;&#x76EE;&#x524D;&#x6240;&#x638C;&#x63E1;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x77E5;&#x9053;A,B,A&#x2019;,B&#x2019;&#x8FD9;&#x56DB;&#x4E2A;&#x70B9;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x4E24;&#x6B21;&#x624B;&#x6307;&#xFF09;&#x7684;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#xFF0C;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x7EBF;&#x6BB5;AB&#x548C;A&#x2019;B&#x2019;&#x7684;&#x6240;&#x6709;&#x4FE1;&#x606F;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x5229;&#x7528;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x6765;&#x6C42;&#x51FA;<strong>&#x3B8;</strong>&#x5462;&#xFF0C;&#x8FD9;&#x65F6;&#x4E3A;&#x4E86;&#x660E;&#x4E86;&#x4E00;&#x70B9;&#xFF0C;&#x6211;&#x628A;A&#x2019;B&#x2019;&#x5411;&#x4E0B;&#x5E73;&#x79FB;&#x4E00;&#x4E0B;&#xFF0C;&#x53D8;&#x6210;&#x56FE;&#x4E2D;&#x4E0B;&#x534A;&#x90E8;&#x5206;&#x7070;&#x8272;&#x7684;A&#x2019;B&#x2019;&#xFF0C;&#x5C06;&#x5E73;&#x79FB;&#x540E;&#x7684;&#x56FE;&#x4ECD;&#x5728;&#x76F4;&#x89D2;&#x5750;&#x6807;&#x7CFB;&#x4E2D;&#xFF0C;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#x3002;&#x5728;&#x56FE;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#xFF0C;<strong>&#x3B8;&#xFF0C;&#x3B3;&#xFF0C;&#x3B2;</strong>&#x4E4B;&#x95F4;&#x6709;&#x5F88;&#x5F88;&#x660E;&#x663E;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5373;<strong>&#x3B8;=&#x3B3;-&#x3B2;</strong>&#xFF0C;&#x4E8E;&#x662F;&#xFF0C;&#x95EE;&#x9898;&#x53C8;&#x8FDB;&#x4E00;&#x6B65;&#x8F6C;&#x79FB;&#x5230;<strong>&#x3B3;&#xFF0C;&#x3B2;</strong>&#x3002;&#x5230;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5206;&#x522B;&#x6C42;&#x51FA;<strong>&#x3B3;&#xFF0C;&#x3B2;</strong>&#x7684;&#x6B63;&#x5F26;&#x6216;&#x8005;&#x4F59;&#x5F26;&#xFF0C;&#x95EE;&#x9898;&#x81EA;&#x7136;&#x5C31;&#x89E3;&#x5F00;&#x4E86;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x6570;&#x5B66;&#x5389;&#x5BB3;&#x7684;&#x4EBA;&#x53EF;&#x80FD;&#x60F3;&#x8D77;&#x4E86;&#x4F59;&#x5F26;&#x5B9A;&#x7406;&#x76F8;&#x5173;&#x7684;&#x4E00;&#x4E9B;&#x6269;&#x5C55;&#x516C;&#x5F0F;&#xFF08;&#x4E00;&#x5B9A;&#x8981;&#x73CD;&#x60DC;&#x4F60;&#x8EAB;&#x8FB9;&#x7684;&#x8FD9;&#x4E9B;&#x6570;&#x5B66;&#x5389;&#x5BB3;&#x7684;&#x4EBA;&#xFF0C;&#x6539;&#x53D8;&#x4E16;&#x754C;&#x5C31;&#x6307;&#x671B;&#x8FD9;&#x4E9B;&#x4EBA;&#x4E86;&#xFF09;&#xFF0C;&#x5373;Cos(&#x3B8;) = Cos(&#x3B3;-&#x3B2;) = Cos(&#x3B3;) Cos(&#x3B2;)  +  Sin(&#x3B3;) Sin (&#x3B2;)&#xFF1B;&#x6700;&#x540E;&#x901A;&#x8FC7;js&#x7684;&#x53CD;&#x4F59;&#x5F26;&#x51FD;&#x6570;&#x6C42;&#x5F97;<strong>&#x3B8;</strong>&#x3002;&#x4E8E;&#x662F;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x53C8;&#x660E;&#x4E86;&#x4E86;&#x4E0D;&#x5C11;&#xFF0C;&#x4E0B;&#x9762;&#x5C31;&#x94FA;&#x51FA;&#x4E00;&#x6BB5;&#x4F2A;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>target.addEventListener(&apos;touchmove&apos;,function(e){
    //&#x8BB0;&#x5F55;&#x5F53;&#x524D;&#x548C;&#x4E4B;&#x524D;&#x4E00;&#x6B21;&#x624B;&#x6307;&#x5206;&#x522B;&#x5BF9;&#x5E94;&#x7684;&#x7AD6;&#x76F4;&#x548C;&#x6C34;&#x5E73;&#x5DEE;&#x4FE1;&#x606F;&#x3002;&#x8BBE;&#x4E3A;&#xFF1A;curY,curX,lastY,lastX&#x3002;&#x7528;&#x4E0A;&#x9762;&#x7684;&#x4F59;&#x5F26;&#x6C42;&#x5DEE;&#x65B9;&#x6CD5;&#x53EF;&#x5F97;&#x5230;
    var cos&#x3B8; = (curX*lastX + curY*lastY)/(Math.sqrt(curY*curY + curX*curX)*Math.sqrt(lastY*lastY + lastX*lastX))&#xFF1B;
    e.angle = Math.acos(cos&#x3B8;);
    rotate(e);//&#x65CB;&#x8F6C;&#x81EA;&#x5B9A;&#x4E49;&#x56DE;&#x8C03;&#x51FD;&#x6570;
},false);
</code></pre><p>&#x65CB;&#x8F6C;&#x5173;&#x952E;&#x70B9;&#x5728;&#x4E8E;&#x5206;&#x6790;&#x6E05;&#x695A;&#x65CB;&#x8F6C;&#x7EC6;&#x8282;&#x4E2D;&#x4FE1;&#x606F;&#xFF0C;&#x8FD0;&#x7528;&#x6570;&#x5B66;&#x4E2D;&#x4E09;&#x89D2;&#x51FD;&#x6570;&#x76F8;&#x5173;&#x6982;&#x5FF5;&#x6765;&#x5E2E;&#x52A9;&#x8BA1;&#x7B97;&#x3002;</p>
<p>##&#x653E;&#x5927;&#xFF0F;&#x7F29;&#x5C0F;&#xFF08;scale&#xFF09;<br>&#x653E;&#x5927;&#x548C;&#x7F29;&#x5C0F;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x4F1A;&#x5728;&#x4E00;&#x4E9B;&#x56FE;&#x7247;&#x8C03;&#x6574;&#x4FEE;&#x6539;&#x7684;&#x65F6;&#x5019;&#x9047;&#x5230;&#xFF0C;&#x5728;&#x64CD;&#x4F5C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5206;&#x522B;&#x8BA1;&#x7B97;&#x51FA;&#x76F8;&#x90BB;&#x4E24;&#x6B21;&#x624B;&#x6307;&#x95F4;&#x7684;&#x95F4;&#x8DDD;&#xFF0C;&#x7136;&#x540E;&#x6C42;&#x7684;&#x5F53;&#x524D;&#x548C;&#x4E0A;&#x6B21;&#x7684;&#x6BD4;&#x503C;&#xFF0C;&#x6BD4;&#x503C;&#x5C31;&#x662F;&#x9700;&#x8981;&#x7F29;&#x5C0F;&#x653E;&#x5927;&#x7684;&#x500D;&#x6570;&#x3002;&#x5982;&#x56FE;&#xFF1A;<br><a href="pinch.png"></a><br>&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>target.addEventListener(&apos;touchmove&apos;,function(e){
    //&#x5206;&#x522B;&#x8BA1;&#x7B97;&#x51FA;&#x76F8;&#x90BB;&#x4E24;&#x6B21;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x6C42;&#x7684;&#x5176;&#x6BD4;&#x503C;&#x3002;&#x5047;&#x8BBE;&#x957F;&#x5EA6;&#x5206;&#x522B;&#x4E3A;L1,L2;
    e.scale = L1/L2;
    scale(e);//&#x7F29;&#x5C0F;&#x653E;&#x5927;&#x81EA;&#x5B9A;&#x4E49;&#x56DE;&#x8C03;&#x51FD;&#x6570;
},false);
</code></pre><p>##&#x6ED1;&#x52A8;(swipe)<br>&#x6ED1;&#x52A8;&#x5143;&#x7D20;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x7ECF;&#x5E38;&#x5728;h5&#x6D3B;&#x52A8;&#x9875;&#x9762;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x5207;&#x5C4F;&#x6548;&#x679C;&#x6216;&#x8005;&#x76F8;&#x518C;&#x6D4F;&#x89C8;&#x6548;&#x679C;&#x3002;&#x5B83;&#x7684;&#x5224;&#x65AD;&#x4F9D;&#x636E;&#x4E3B;&#x8981;&#x662F;&#x6309;&#x4E0B;&#x7684;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#x548C;&#x62AC;&#x8D77;&#x7684;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#x5DEE;&#x503C;&#xFF0C;&#x4ECE;&#x800C;&#x5F97;&#x5230;&#x5143;&#x7D20;&#x6ED1;&#x52A8;&#x7684;&#x65B9;&#x5411;&#x3002;&#x5176;&#x4E2D;&#x9700;&#x8981;&#x5224;&#x65AD;&#x4E0B;&#x6ED1;&#x52A8;&#x7684;&#x89E6;&#x53D1;&#x70B9;&#xFF0C;&#x5373;&#x5C31;&#x662F;&#x5728;&#x600E;&#x4E48;&#x6837;&#x4E00;&#x4E2A;&#x5DEE;&#x503C;&#x5916;&#x7B97;&#x662F;&#x6ED1;&#x52A8;&#x4E86;&#x3002;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>target.addEventListener(&apos;touchstart&apos;,function(e){
    //&#x8BB0;&#x5F55;&#x6309;&#x4E0B;&#x7684;&#x4FE1;&#x606F;
    startx = e.touches[0].pageX;
    starty = e.touches[0].pageY;
},false);
target.addEventListener(&apos;touchend&apos;,function(e){
    //&#x901A;&#x8FC7;&#x62AC;&#x8D77;&#x65F6;&#x7684;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#xFF0C;&#x8BA1;&#x7B97;&#x51FA;&#x6ED1;&#x52A8;&#x65B9;&#x5411;
    endx = e.touches[0].pageX;
    endy = e.touches[0].pageY;
    if ((Math.abs(endx - startx) &gt; 30) || (Math.abs(endy - starty) &gt; 30)){
        e.dir = Math.abs(endx - startx) &gt;= Math.abs(endy - starty) ? (endx - startx &gt; 0 ? &apos;Right&apos; : &apos;Left&apos;) : (endy - starty &gt; 0 ? &apos;Up&apos; : &apos;Down&apos;);
    }
},false);
</code></pre><p>##&#x62D6;&#x52A8;&#xFF08;drop&#xFF09;<br>&#x62D6;&#x52A8;&#x5143;&#x7D20;&#xFF0C;&#x786E;&#x5207;&#x7684;&#x8BF4;&#x5E94;&#x8BE5;&#x662F;&#x79FB;&#x52A8;&#x5143;&#x7D20;&#xFF0C;&#x4E0D;&#x8981;&#x7406;&#x89E3;&#x4E3A;&#x62D6;&#x52A8;&#x4E8B;&#x4EF6;&#x90A3;&#x4E2A;&#x62D6;&#x52A8;&#xFF0C;&#x8FD9;&#x91CC;&#x6307;&#x7684;&#x662F;&#x5143;&#x7D20;&#x8DDF;&#x968F;&#x624B;&#x6307;&#x79FB;&#x52A8;&#xFF0C;&#x5B9E;&#x73B0;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x51FA;&#x76F8;&#x90BB;&#x4E24;&#x6B21;&#x79FB;&#x52A8;&#x7684;&#x8DDD;&#x79BB;&#x5C31;&#x884C;&#xFF0C;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>target.addEventListener(&apos;touchmove&apos;,function(e){
    //&#x8BA1;&#x7B97;&#x51FA;&#x76F8;&#x90BB;&#x4E24;&#x6B21;&#x5BF9;&#x5E94;&#x5750;&#x6807;&#x7684;&#x5DEE;&#x503C;&#x5373;&#x53EF;&#xFF0C;&#x5047;&#x8BBE;&#x5F53;&#x524D;&#x548C;&#x4E0A;&#x6B21;&#x5206;&#x522B;&#x4E3A;&#xFF08;curx,cury&#xFF09;,(lastx,lasty);
    e.deltax = curx-lastx;
    e.deltay = cury-lasty;
    drop(e);//&#x62D6;&#x52A8;&#x81EA;&#x5B9A;&#x4E49;&#x56DE;&#x8C03;&#x51FD;&#x6570;
},false);
</code></pre><hr>
<p>&#x4EE5;&#x4E0A;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x4E86;&#x4E0B;&#x5E38;&#x7528;&#x624B;&#x52BF;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#xFF0C;&#x7531;&#x4E8E;&#x597D;&#x591A;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x90FD;&#x4EE5;&#x4F2A;&#x4EE3;&#x7801;&#x7684;&#x5F62;&#x5F0F;&#x7ED9;&#x51FA;&#xFF0C;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x53EF;&#x81EA;&#x5DF1;&#x5B8C;&#x5584;&#x3002;&#x5F53;&#x7136;&#x66F4;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x7EFC;&#x5408;&#x624B;&#x52BF;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5F53;&#x524D;&#x57FA;&#x7840;&#x4E0A;&#x5C06;&#x8FD9;&#x4E9B;&#x878D;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x66F4;&#x901A;&#x7528;&#x7684;&#x624B;&#x52BF;&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x5BF9;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x6709;&#x5174;&#x8DA3;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x5F00;&#x5934;&#x7ED9;&#x51FA;&#x7684;demo,&#x91CC;&#x9762;&#x6709;&#x8BE6;&#x5C3D;&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x7531;&#x4E8E;&#x4E2A;&#x4EBA;&#x5BF9;&#x77E5;&#x8BC6;&#x7684;&#x7406;&#x89E3;&#x90FD;&#x4E0D;&#x662F;&#x5F88;&#x5B8C;&#x5584;&#xFF0C;&#x6240;&#x4EE5;&#x96BE;&#x514D;&#x4F1A;&#x51FA;&#x73B0;&#x5F88;&#x591A;&#x9519;&#x8BEF;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x8FD8;&#x671B;&#x591A;&#x591A;&#x6307;&#x6559;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/js/" rel="tag">#js</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/12/24/移动端弹性滑动解决方案（哭泣版）/" rel="next" title="移动端弹性滑动解决方案（哭泣版）">
                <i class="fa fa-chevron-left"></i> 移动端弹性滑动解决方案（哭泣版）
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2017/01/03/移动端手势事件浅析/"
           data-title="移动端手势事件浅析" data-url="http://yoursite.com/2017/01/03/移动端手势事件浅析/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="//schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/uploads/avatar.jpg"
               alt="牛海彬" />
          <p class="site-author-name" itemprop="name">牛海彬</p>
          <p class="site-description motion-element" itemprop="description">牛海彬的个人博客，web前端，javascript，css，html，nodejs分享</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">12</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">4</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">牛海彬</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Muse
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.2"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.2"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.2"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.2"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.2"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"sadrun"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    <script src="/lib/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  






  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
       search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();

    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
    'use strict';
    $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
            // get the contents from search data
            isfetched = true;
            $('.popup').detach().appendTo('.header-inner');
            var datas = $( "entry", xmlResponse ).map(function() {
                return {
                    title: $( "title", this ).text(),
                    content: $("content",this).text(),
                    url: $( "url" , this).text()
                };
            }).get();
            var $input = document.getElementById(search_id);
            var $resultContent = document.getElementById(content_id);
            $input.addEventListener('input', function(){
                var matchcounts = 0;
                var str='<ul class=\"search-result-list\">';
                var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
                $resultContent.innerHTML = "";
                if (this.value.trim().length > 1) {
                // perform local searching
                datas.forEach(function(data) {
                    var isMatch = false;
                    var content_index = [];
                    var data_title = data.title.trim().toLowerCase();
                    var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                    var data_url = data.url;
                    var index_title = -1;
                    var index_content = -1;
                    var first_occur = -1;
                    // only match artiles with not empty titles and contents
                    if(data_title != '') {
                        keywords.forEach(function(keyword, i) {
                            index_title = data_title.indexOf(keyword);
                            index_content = data_content.indexOf(keyword);
                            if( index_title >= 0 || index_content >= 0 ){
                                isMatch = true;
								if (i == 0) {
                                    first_occur = index_content;
                                }
                            } 
							
                        });
                    }
                    // show search results
                    if (isMatch) {
                        matchcounts += 1;
                        str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                        var content = data.content.trim().replace(/<[^>]+>/g,"");
                        if (first_occur >= 0) {
                            // cut out 100 characters
                            var start = first_occur - 20;
                            var end = first_occur + 80;
                            if(start < 0){
                                start = 0;
                            }
                            if(start == 0){
                                end = 50;
                            }
                            if(end > content.length){
                                end = content.length;
                            }
                            var match_content = content.substring(start, end);
                            // highlight all keywords
                            keywords.forEach(function(keyword){
                                var regS = new RegExp(keyword, "gi");
                                match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                            });

                            str += "<p class=\"search-result\">" + match_content +"...</p>"
                        }
                        str += "</li>";
                    }
                })};
                str += "</ul>";
                if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
                if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
                $resultContent.innerHTML = str;
            });
            proceedsearch();
        }
    });}

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };

    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>


  

  

  
  <script src="https://cdn1.lncld.net/static/js/av-core-mini-0.6.1.js"></script>
  <script>AV.initialize("VdAXdTW9DvQJbNBGOMYg3zXq-gzGzoHsz", "QMOVVilXXDJdPwoJw6aRrUfY");</script>
  <script>
    function showTime(Counter) {
      var query = new AV.Query(Counter);
      var entries = [];
      var $visitors = $(".leancloud_visitors");

      $visitors.each(function () {
        entries.push( $(this).attr("id").trim() );
      });

      query.containedIn('url', entries);
      query.find()
        .done(function (results) {
          var COUNT_CONTAINER_REF = '.leancloud-visitors-count';

          if (results.length === 0) {
            $visitors.find(COUNT_CONTAINER_REF).text(0);
            return;
          }

          for (var i = 0; i < results.length; i++) {
            var item = results[i];
            var url = item.get('url');
            var time = item.get('time');
            var element = document.getElementById(url);

            $(element).find(COUNT_CONTAINER_REF).text(time);
          }
          for(var i = 0; i < entries.length; i++) {
            var url = entries[i];
            var element = document.getElementById(url);
            var countSpan = $(element).find(COUNT_CONTAINER_REF);
            if( countSpan.text() == '') {
              countSpan.text(0);
            }
          }
        })
        .fail(function (object, error) {
          console.log("Error: " + error.code + " " + error.message);
        });
    }

    function addCount(Counter) {
      var $visitors = $(".leancloud_visitors");
      var url = $visitors.attr('id').trim();
      var title = $visitors.attr('data-flag-title').trim();
      var query = new AV.Query(Counter);

      query.equalTo("url", url);
      query.find({
        success: function(results) {
          if (results.length > 0) {
            var counter = results[0];
            counter.fetchWhenSave(true);
            counter.increment("time");
            counter.save(null, {
              success: function(counter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(counter.get('time'));
              },
              error: function(counter, error) {
                console.log('Failed to save Visitor num, with error message: ' + error.message);
              }
            });
          } else {
            var newcounter = new Counter();
            /* Set ACL */
            var acl = new AV.ACL();
            acl.setPublicReadAccess(true);
            acl.setPublicWriteAccess(true);
            newcounter.setACL(acl);
            /* End Set ACL */
            newcounter.set("title", title);
            newcounter.set("url", url);
            newcounter.set("time", 1);
            newcounter.save(null, {
              success: function(newcounter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(newcounter.get('time'));
              },
              error: function(newcounter, error) {
                console.log('Failed to create');
              }
            });
          }
        },
        error: function(error) {
          console.log('Error:' + error.code + " " + error.message);
        }
      });
    }

    $(function() {
      var Counter = AV.Object.extend("Counter");
      if ($('.leancloud_visitors').length == 1) {
        addCount(Counter);
      } else if ($('.post-title-link').length > 1) {
        showTime(Counter);
      }
    });
  </script>



  
<script type="text/javascript" async src="//push.zhanzhang.baidu.com/push.js">
</script>


</body>
</html>
