<!doctype html>



  


<html class="theme-next muse use-motion">
<head><meta name="generator" content="Hexo 3.8.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">



<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    
    

  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css">

<link href="/css/main.css?v=5.0.2" rel="stylesheet" type="text/css">


  <meta name="keywords" content="javascript,">








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.2">






<meta name="description" content="&amp;#x56DE;&amp;#x5FC6;&amp;#x5C31;&amp;#x597D;&amp;#x50CF;&amp;#x7F13;&amp;#x5B58;&amp;#xFF0C;&amp;#x4E0D;&amp;#x6E05;&amp;#x4E00;&amp;#x6E05;&amp;#xFF0C;&amp;#x600E;&amp;#x4E48;&amp;#x80FD;&amp;#x770B;&amp;#x5230;&amp;#x672A;&amp;#x6765;&amp;#x3002;  &amp;#x6700;&amp;#x8FD1;&amp;#x51E0;&amp;#x59">
<meta name="keywords" content="javascript">
<meta property="og:type" content="article">
<meta property="og:title" content="ajax文件上传功能简述">
<meta property="og:url" content="http://yoursite.com/2016/11/14/ajax文件上传功能简述/index.html">
<meta property="og:site_name" content="暮歌">
<meta property="og:description" content="&amp;#x56DE;&amp;#x5FC6;&amp;#x5C31;&amp;#x597D;&amp;#x50CF;&amp;#x7F13;&amp;#x5B58;&amp;#xFF0C;&amp;#x4E0D;&amp;#x6E05;&amp;#x4E00;&amp;#x6E05;&amp;#xFF0C;&amp;#x600E;&amp;#x4E48;&amp;#x80FD;&amp;#x770B;&amp;#x5230;&amp;#x672A;&amp;#x6765;&amp;#x3002;  &amp;#x6700;&amp;#x8FD1;&amp;#x51E0;&amp;#x59">
<meta property="og:locale" content="zh-Hans">
<meta property="og:updated_time" content="2016-12-12T06:02:09.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="ajax文件上传功能简述">
<meta name="twitter:description" content="&amp;#x56DE;&amp;#x5FC6;&amp;#x5C31;&amp;#x597D;&amp;#x50CF;&amp;#x7F13;&amp;#x5B58;&amp;#xFF0C;&amp;#x4E0D;&amp;#x6E05;&amp;#x4E00;&amp;#x6E05;&amp;#xFF0C;&amp;#x600E;&amp;#x4E48;&amp;#x80FD;&amp;#x770B;&amp;#x5230;&amp;#x672A;&amp;#x6765;&amp;#x3002;  &amp;#x6700;&amp;#x8FD1;&amp;#x51E0;&amp;#x59">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Muse',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://yoursite.com/2016/11/14/ajax文件上传功能简述/">


  <title> ajax文件上传功能简述 | 暮歌 </title>
</head>

<body itemscope itemtype="//schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="//schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/" class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">暮歌</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">web前端技术分享</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br>
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br>
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br>
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br>
            
            标签
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br>
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup">
 <span class="search-icon fa fa-search"></span>
 <input type="text" id="local-search-input">
 <div id="local-search-result"></div>
 <span class="popup-btn-close">close</span>
</div>


    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="//schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                ajax文件上传功能简述
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-11-14T18:57:34+08:00" content="2016-11-14">
              2016-11-14
            </time>
          </span>

          
            <span class="post-category">
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/技术/" itemprop="url" rel="index">
                    <span itemprop="name">技术</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/11/14/ajax文件上传功能简述/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/11/14/ajax文件上传功能简述/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          
             <span id="/2016/11/14/ajax文件上传功能简述/" class="leancloud_visitors" data-flag-title="ajax文件上传功能简述">
               &nbsp; | &nbsp;
               <span class="post-meta-item-icon">
                 <i class="fa fa-eye"></i>
               </span>
               <span class="post-meta-item-text">阅读次数 </span>
               <span class="leancloud-visitors-count"></span>
              </span>
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <blockquote>
<p>&#x56DE;&#x5FC6;&#x5C31;&#x597D;&#x50CF;&#x7F13;&#x5B58;&#xFF0C;&#x4E0D;&#x6E05;&#x4E00;&#x6E05;&#xFF0C;&#x600E;&#x4E48;&#x80FD;&#x770B;&#x5230;&#x672A;&#x6765;&#x3002;</p>
</blockquote>
<p><strong>&#x6700;</strong>&#x8FD1;&#x51E0;&#x5929;&#x4E00;&#x76F4;&#x5728;&#x5FD9;&#x7740;&#x641E;&#x4E2A;&#x89C6;&#x9891;&#x4E0A;&#x4F20;&#x529F;&#x80FD;&#xFF0C;&#x672C;&#x6765;&#x60F3;&#x60F3;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x524D;&#x7AEF;&#x4E0A;&#x4F20;&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x505A;&#x5904;&#x7406;&#xFF0C;&#x8FD4;&#x56DE;&#x72B6;&#x6001;&#x3002;&#x53EF;&#x662F;&#x504F;&#x504F;&#x8981;&#x96C6;&#x6210;&#x5728;&#x767E;&#x5EA6;&#x7684;ueditor&#x4E2D;&#xFF0C;&#x65B9;&#x4FBF;&#x6211;&#x4EEC;&#x8FD0;&#x8425;&#x4EBA;&#x5458;&#x4F7F;&#x7528;&#xFF0C;&#x4E8E;&#x662F;&#x95EE;&#x9898;&#x5C31;&#x53D8;&#x5F97;&#x6076;&#x5FC3;&#x4E86;&#x3002;&#x6700;&#x521D;&#x5F53;&#x7136;&#x662F;&#x770B;&#x76F8;&#x5173;&#x7684;api&#x6587;&#x6863;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x6309;&#x7740;&#x6D41;&#x7A0B;&#x8D70;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x7ED3;&#x679C;&#x53D1;&#x73B0;&#xFF0C;&#x4E4B;&#x524D;&#x7EF4;&#x62A4;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x8C8C;&#x4F3C;&#x6CA1;&#x6309;&#x5957;&#x8DEF;&#x6765;&#xFF0C;&#x914D;&#x7F6E;&#x8D70;&#x4E86;&#x5176;&#x4ED6;&#x65B9;&#x5F0F;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x5C31;&#x60F3;&#x54ED;&#x4E86;&#x3002;&#x7ECF;&#x8FC7;&#x4E24;&#x5929;&#x7684;&#x82E6;&#x6218;&#x4E4B;&#x540E;&#xFF0C;&#x6478;&#x5230;&#x95E8;&#x8DEF;&#xFF0C;&#x7EC8;&#x4E8E;&#x628A;&#x89C6;&#x9891;&#x4E0A;&#x4F20;&#x529F;&#x80FD;&#x7684;&#x5957;&#x5B50;&#x7ED9;&#x5EFA;&#x8BBE;&#x597D;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x5F00;&#x5F00;&#x5FC3;&#x5FC3;&#x7684;&#x641E;&#x529F;&#x80FD;&#x4E86;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x8C08;&#x8C08;&#x4E0A;&#x4F20;&#x6240;&#x6D89;&#x53CA;&#x7684;&#x524D;&#x7AEF;&#x6280;&#x672F;&#x3002;<br><strong>&#x5148;</strong>&#x6765;&#x7B80;&#x5355;&#x626F;&#x626F;&#x4EE5;&#x524D;&#x7684;&#x4E0A;&#x4F20;&#x6587;&#x4EF6;&#x65B9;&#x5F0F;&#xFF08;flash&#x63D2;&#x4EF6;&#x4E4B;&#x7C7B;&#x7684;&#x6211;&#x5C31;&#x4E0D;&#x63D0;&#x4E86;&#xFF0C;&#x6BD5;&#x7ADF;&#x8FD9;&#x79CD;&#x9AD8;&#x7EA7;&#x8D27;&#x5BF9;&#x4E8E;&#x524D;&#x7AEF;&#x6765;&#x8BF4;&#x4F1A;&#x7528;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x522B;&#x592A;&#x6267;&#x7740;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x7684;&#xFF09;&#x3002;<a id="more"></a>&#x57FA;&#x672C;&#x5927;&#x90FD;&#x662F;&#x901A;&#x8FC7;form&#x8868;&#x5355;&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x4F46;&#x662F;&#x9875;&#x9762;&#x4F1A;&#x5237;&#x65B0;&#xFF0C;&#x8FD9;&#x79CD;&#x4F53;&#x9A8C;&#x611F;&#x7ED9;&#x4EBA;&#x611F;&#x89C9;&#x5F88;&#x4E0D;&#x53CB;&#x597D;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x6709;&#x4EBA;&#x901A;&#x8FC7;&#x9690;&#x85CF;&#x7684;iframe&#x6765;&#x5B8C;&#x6210;&#x8868;&#x5355;&#x63D0;&#x4EA4;&#xFF0C;&#x5C31;&#x5B9E;&#x73B0;&#x4E86;&#x65E0;&#x5237;&#x65B0;&#x7684;&#x4E0A;&#x4F20;&#x529F;&#x80FD;&#xFF0C;&#x4F53;&#x9A8C;&#x5EA6;&#x5F97;&#x5230;&#x4E86;&#x76F4;&#x7EBF;&#x4E0A;&#x5347;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x8FC7;iframe&#x6765;&#x5B8C;&#x6210;&#x65E0;&#x5237;&#x65B0;&#x4E0A;&#x4F20;&#x59CB;&#x7EC8;&#x7ED9;&#x4EBA;&#x611F;&#x89C9;&#x592A;&#x8FC7;&#x4E8E;&#x7E41;&#x7410;&#xFF0C;&#x4E0D;&#x592A;&#x76F4;&#x89C2;&#xFF0C;&#x6BD5;&#x7ADF;&#x6211;&#x4EEC;&#x4E60;&#x60EF;&#x4E86;&#x7528;ajax&#x4E0E;&#x670D;&#x52A1;&#x7AEF;&#x6765;&#x4EA4;&#x4E92;&#xFF0C;&#x4E00;&#x76F4;&#x60F3;&#x7740;&#x80FD;&#x7528;ajax&#x6765;&#x5B8C;&#x6210;&#x8868;&#x5355;&#x7684;&#x63D0;&#x4EA4;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x51E0;&#x5E74;&#x524D;&#xFF08;&#x5177;&#x4F53;&#x51E0;&#x5E74;&#x6211;&#x771F;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x6211;&#x5165;&#x524D;&#x7AEF;&#x4E5F;&#x5C31;&#x4E24;&#x5E74;0.0&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x6CA1;&#x6CD5;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8001;&#x7684;ajax&#x6280;&#x672F;&#x4E2D;XMLHttpRequest&#x5BF9;&#x8C61;&#x6709;&#x4E00;&#x4E9B;&#x7F3A;&#x9677;&#xFF1A;</p>
<blockquote>
<ul>
<li>&#x53EA;&#x652F;&#x6301;&#x6587;&#x672C;&#x6570;&#x636E;&#x7684;&#x4F20;&#x9001;&#xFF0C;&#x4E0D;&#x652F;&#x6301;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x7684;&#x4E0A;&#x4F20;&#x3002;</li>
<li>&#x4E0D;&#x652F;&#x6301;&#x8DE8;&#x57DF;</li>
</ul>
</blockquote>
<p>&#x7136;&#x540E;&#x5728;&#x65B0;&#x7248;&#x672C;&#x4E2D;&#x505A;&#x4E86;&#x597D;&#x591A;&#x6539;&#x8FDB;&#xFF0C;&#x5176;&#x4E2D;&#x4E24;&#x6761;&#x90A3;&#x80AF;&#x5B9A;&#x662F;&#x5BF9;&#x4E0A;&#x9762;&#x90A3;&#x4E24;&#x4E2A;&#x7F3A;&#x9677;&#x4FEE;&#x590D;&#x4E86;&#xFF0C;&#x5373;&#x652F;&#x6301;&#x4E86;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x7684;&#x4E0A;&#x4F20;&#xFF0C;&#x652F;&#x6301;&#x4E86;&#x8DE8;&#x57DF;&#xFF0C;&#x652F;&#x6301;&#x4E86;&#x8FDB;&#x5EA6;&#x66F4;&#x65B0;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x5C31;&#x4E0D;&#x8BF4;&#x4E86;&#xFF0C;&#x81EA;&#x884C;&#x767E;&#x5EA6;&#x3002;<br>&#x65E2;&#x7136;&#x652F;&#x6301;&#x4E86;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x4E0A;&#x4F20;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x7684;&#x6587;&#x4EF6;&#x4E0A;&#x4F20;&#x529F;&#x80FD;&#x5728;&#x73B0;&#x4EE3;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x719F;&#x6089;&#x7684;ajax&#x914D;&#x5408;h5&#x7684;FormData&#x5BF9;&#x8C61;&#x6765;&#x5B8C;&#x6210;&#xFF0C;FormData &#x53EF;&#x4EE5;&#x6A21;&#x62DF;&#x8868;&#x5355;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x952E;&#x503C;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x3002;&#x7136;&#x540E;&#x90A3;&#x4E9B;&#x5E74;&#x8BA9;&#x4EBA;&#x5934;&#x75DB;&#x7684;&#x4E0A;&#x4F20;&#x529F;&#x80FD;&#x5C31;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x4E3A;&#x4E00;&#x4E0B;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>var data = new FormData(form/null);//&#x53EF;&#x4EE5;&#x662F;&#x8868;&#x5355;&#x5BF9;&#x8C61;&#xFF0C;&#x6216;&#x8005;&#x4E3A;&#x7A7A;&#xFF0C;&#x540E;&#x8FB9;&#x81EA;&#x5DF1;&#x6DFB;&#x52A0;&#x6570;&#x636E;&#x3002;
$.ajax({ 
    url: &apos;http://sadrun.duapp.com/upload&apos;,//&#x63A5;&#x53E3; 
    type: &apos;POST&apos;,  
    data: data,   
    processData: false,  //&#x544A;&#x8BC9;jquery&#x5BF9;&#x8C61;&#x5904;&#x7406;&#x4F60;&#x8981;&#x53D1;&#x9001;&#x7684;&#x6570;&#x636E;
    contentType: false, //&#x544A;&#x8BC9;jquery&#x4E0D;&#x8981;&#x53BB;&#x7ED9;&#x522B;&#x4EBA;&#x4E71;&#x52A0;&#x8BF7;&#x6C42;&#x5934;&#x7C7B;&#x578B;
    success:function(res){
        //to do
    },
    xhr: function(){
        var xhr = $.ajaxSettings.xhr();//&#x5F97;&#x5230;xhr&#x5BF9;&#x8C61;
            if(xhr.upload) {
                xhr.upload.addEventListener(&quot;progress&quot; , function(evt){
                //evt.loaded,evt.total
                },false);
                return xhr;
            }
    },
    error:function(){
        //....
    }
});
</code></pre><p>&#x4E0A;&#x9762;&#x57FA;&#x672C;&#x7B97;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;ajax&#x6587;&#x4EF6;&#x4E0A;&#x4F20;&#x4EE3;&#x7801;&#x3002;&#x81EA;&#x5DF1;&#x5F53;&#x65F6;&#x518D;&#x505A;&#x4E0A;&#x4F20;&#x529F;&#x80FD;&#x65F6;&#x4E34;&#x65F6;&#x505A;&#x4E86;&#x4E2A;&#x6D4B;&#x8BD5;<strong><a href="http://sadrun.duapp.com/skyexample/upload" target="_blank" rel="noopener">demo</a>:</strong><a href="http://sadrun.duapp.com/skyexample/upload" target="_blank" rel="noopener">http://sadrun.duapp.com/skyexample/upload</a> &#x7531;&#x4E8E;&#x4EC5;&#x4EC5;&#x662F;&#x6D4B;&#x8BD5;&#xFF0C;&#x4EE3;&#x7801;&#x672A;&#x505A;&#x4F18;&#x5316;&#xFF0C;&#x6BD4;&#x8F83;&#x4E11;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x592A;&#x559C;&#x6B22;jquery&#x7684;&#x53EF;&#x4EE5;&#x7528;&#x539F;&#x751F;&#x7684;ajax&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x4EE3;&#x7801;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x6574;&#x6D01;&#xFF0C;&#x8BE5;demo&#x4EE3;&#x7801;&#x4E2D;&#x4E5F;&#x6709;&#x76F8;&#x5E94;&#x4F8B;&#x5B50;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E0D;&#x5B8C;&#x6574;&#xFF0C;&#x4E5F;&#x4E0D;&#x591A;&#x8BF4;&#xFF0C;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x53D1;&#x6325;&#x3002;<br>&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6216;&#x8BB8;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x8DE8;&#x57DF;&#x4E86;&#x600E;&#x4E48;&#x529E;&#xFF0C;&#x4E0A;&#x9762;&#x4EE3;&#x7801;&#x5E76;&#x6CA1;&#x6709;&#x505A;&#x8DE8;&#x57DF;&#x76F8;&#x5173;&#x7684;&#x89E3;&#x91CA;&#x3002;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x8981;&#x77E5;&#x9053;&#xFF0C;&#x8DE8;&#x57DF;&#x53D7;&#x4E24;&#x65B9;&#x9762;&#x9650;&#x5236;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x6765;&#x81EA;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x6765;&#x81EA;&#x670D;&#x52A1;&#x7AEF;&#xFF0C;&#x65E2;&#x7136;&#x6211;&#x4EEC;&#x90FD;&#x5728;&#x7528;&#x73B0;&#x4EE3;&#x6D4F;&#x89C8;&#x5668;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x81EA;&#x7136;&#x6D4F;&#x89C8;&#x5668;&#x5141;&#x8BB8;&#x4F60;&#x8DE8;&#x57DF;&#x4E86;&#xFF0C;&#x652F;&#x6301;&#x4F60;&#x8DE8;&#x57DF;&#x7684;&#x8FD9;&#x4E2A;&#x9700;&#x6C42;&#xFF0C;&#x90A3;&#x4E48;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x662F;&#x670D;&#x52A1;&#x7AEF;&#x662F;&#x5426;&#x652F;&#x6301;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4E00;&#x5929;&#x4F60;&#x9047;&#x5230;&#x51FA;&#x73B0;&#x8DE8;&#x57DF;&#x9650;&#x5236;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x4E0D;&#x8981;&#x4E3A;&#x96BE;&#x81EA;&#x5DF1;&#x4E86;&#xFF0C;&#x5927;&#x80C6;&#x7684;&#x53BB;&#x8DDF;&#x670D;&#x52A1;&#x7AEF;&#x540C;&#x5B66;&#x8BF4;&#x4E0B;&#xFF0C;&#x4F60;&#x8FD9;&#x8FB9;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x4E00;&#x4E0B;&#x5141;&#x8BB8;&#x8DE8;&#x57DF;&#x7684;&#x5934;&#xFF0C;&#x7C7B;&#x4F3C;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>res.header(&quot;Access-Control-Allow-Origin&quot;, &quot;*&quot;);//*&#x6307;&#x7684;&#x662F;&#x5141;&#x8BB8;&#x4EFB;&#x4F55;&#x7F51;&#x7AD9;&#x8DE8;&#x57DF;&#x8BF7;&#x6C42;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x4F60;&#x6240;&#x5728;&#x4E00;&#x4E2A;&#x6216;&#x8005;&#x51E0;&#x4E2A;&#x57DF;&#x3002;
</code></pre><p>&#x4E0A;&#x9762;&#x662F;nodejs&#x8BBE;&#x7F6E;&#x65B9;&#x5F0F;&#xFF0C;&#x4E0D;&#x8FC7;&#x65E0;&#x8BBA;&#x662F;&#x54EA;&#x79CD;&#xFF0C;&#x57FA;&#x672C;&#x90FD;&#x662F;&#x5927;&#x540C;&#x5C0F;&#x5F02;&#x3002;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x8FD9;&#x4E24;&#x65B9;&#x9762;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x8DE8;&#x57DF;&#x4E0A;&#x4F20;&#xFF0C;&#x8DE8;&#x57DF;&#x8BF7;&#x6C42;&#x7B49;&#xFF0C;&#x4E0D;&#x7528;&#x5728;&#x4E3A;&#x8DE8;&#x57DF;&#x90A3;&#x4E48;&#x82E6;&#x607C;&#xFF0C;demo&#x4E2D;&#x63A5;&#x53E3;&#x652F;&#x6301;&#x8DE8;&#x57DF;&#x7684;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x672C;&#x5730;&#x8C03;&#x7528;&#x8BD5;&#x8BD5;&#x3002;<br>&#x5662;&#xFF0C;&#x5FD8;&#x4E86;&#x8BF4;IE,IE10&#x4EE5;&#x4E0B;&#xFF0C;&#x5EFA;&#x8BAE;&#x8FD8;&#x662F;&#x7528;&#x4F20;&#x7EDF;&#x7684;&#x8868;&#x5355;&#x65B9;&#x5F0F;&#x5427;&#xFF0C;&#x867D;&#x7136;&#x6CA1;&#x6709;&#x6D4B;&#x8FC7;&#xFF0C;&#x4F46;&#x662F;&#x597D;&#x50CF;&#x4E0D;&#x884C;&#xFF0C;&#x5982;&#x679C;&#x9047;&#x5230;&#xFF0C;&#x8BF7;&#x8C28;&#x614E;&#x7528;&#x6B64;&#x65B9;&#x6CD5;&#x3002;&#x4EE5;&#x4E0A;&#x90FD;&#x662F;&#x4E2A;&#x4EBA;&#x7C97;&#x6D45;&#x7684;&#x8BA4;&#x8BC6;&#x4EE5;&#x53CA;&#x8E69;&#x811A;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x8BB2;&#x9519;&#x6216;&#x8005;&#x6CA1;&#x8BB2;&#x6E05;&#x695A;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6B22;&#x8FCE;&#x7559;&#x8A00;&#x4EA4;&#x6D41;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/javascript/" rel="tag">#javascript</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/10/30/css样式操作之document-styleSheets/" rel="next" title="css样式操作之document.styleSheets">
                <i class="fa fa-chevron-left"></i> css样式操作之document.styleSheets
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/11/15/h5本地图片预览简述/" rel="prev" title="h5本地图片预览简述">
                h5本地图片预览简述 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/11/14/ajax文件上传功能简述/" data-title="ajax文件上传功能简述" data-url="http://yoursite.com/2016/11/14/ajax文件上传功能简述/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="//schema.org/Person">
          <img class="site-author-image" itemprop="image" src="/uploads/avatar.jpg" alt="牛海彬">
          <p class="site-author-name" itemprop="name">牛海彬</p>
          <p class="site-description motion-element" itemprop="description">牛海彬的个人博客，web前端，javascript，css，html，nodejs分享</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">13</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">4</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">
  
  &copy; 
  <span itemprop="copyrightYear">2019</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">牛海彬</span>
</div>

<div class="powered-by">
  欢迎交流
</div>

<div class="theme-info">
  <a class="theme-link" href="https://github.com/sadrun/">
    Github
  </a>
</div>


        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.2"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.2"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.2"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.2"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.2"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"sadrun"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    <script src="/lib/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  






  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
       search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();

    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
    'use strict';
    $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
            // get the contents from search data
            isfetched = true;
            $('.popup').detach().appendTo('.header-inner');
            var datas = $( "entry", xmlResponse ).map(function() {
                return {
                    title: $( "title", this ).text(),
                    content: $("content",this).text(),
                    url: $( "url" , this).text()
                };
            }).get();
            var $input = document.getElementById(search_id);
            var $resultContent = document.getElementById(content_id);
            $input.addEventListener('input', function(){
                var matchcounts = 0;
                var str='<ul class=\"search-result-list\">';
                var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
                $resultContent.innerHTML = "";
                if (this.value.trim().length > 1) {
                // perform local searching
                datas.forEach(function(data) {
                    var isMatch = false;
                    var content_index = [];
                    var data_title = data.title.trim().toLowerCase();
                    var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                    var data_url = data.url;
                    var index_title = -1;
                    var index_content = -1;
                    var first_occur = -1;
                    // only match artiles with not empty titles and contents
                    if(data_title != '') {
                        keywords.forEach(function(keyword, i) {
                            index_title = data_title.indexOf(keyword);
                            index_content = data_content.indexOf(keyword);
                            if( index_title >= 0 || index_content >= 0 ){
                                isMatch = true;
								if (i == 0) {
                                    first_occur = index_content;
                                }
                            } 
							
                        });
                    }
                    // show search results
                    if (isMatch) {
                        matchcounts += 1;
                        str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                        var content = data.content.trim().replace(/<[^>]+>/g,"");
                        if (first_occur >= 0) {
                            // cut out 100 characters
                            var start = first_occur - 20;
                            var end = first_occur + 80;
                            if(start < 0){
                                start = 0;
                            }
                            if(start == 0){
                                end = 50;
                            }
                            if(end > content.length){
                                end = content.length;
                            }
                            var match_content = content.substring(start, end);
                            // highlight all keywords
                            keywords.forEach(function(keyword){
                                var regS = new RegExp(keyword, "gi");
                                match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                            });

                            str += "<p class=\"search-result\">" + match_content +"...</p>"
                        }
                        str += "</li>";
                    }
                })};
                str += "</ul>";
                if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
                if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
                $resultContent.innerHTML = str;
            });
            proceedsearch();
        }
    });}

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };

    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>


  

  

  
  <script src="https://cdn1.lncld.net/static/js/av-core-mini-0.6.1.js"></script>
  <script>AV.initialize("VdAXdTW9DvQJbNBGOMYg3zXq-gzGzoHsz", "QMOVVilXXDJdPwoJw6aRrUfY");</script>
  <script>
    function showTime(Counter) {
      var query = new AV.Query(Counter);
      var entries = [];
      var $visitors = $(".leancloud_visitors");

      $visitors.each(function () {
        entries.push( $(this).attr("id").trim() );
      });

      query.containedIn('url', entries);
      query.find()
        .done(function (results) {
          var COUNT_CONTAINER_REF = '.leancloud-visitors-count';

          if (results.length === 0) {
            $visitors.find(COUNT_CONTAINER_REF).text(0);
            return;
          }

          for (var i = 0; i < results.length; i++) {
            var item = results[i];
            var url = item.get('url');
            var time = item.get('time');
            var element = document.getElementById(url);

            $(element).find(COUNT_CONTAINER_REF).text(time);
          }
          for(var i = 0; i < entries.length; i++) {
            var url = entries[i];
            var element = document.getElementById(url);
            var countSpan = $(element).find(COUNT_CONTAINER_REF);
            if( countSpan.text() == '') {
              countSpan.text(0);
            }
          }
        })
        .fail(function (object, error) {
          console.log("Error: " + error.code + " " + error.message);
        });
    }

    function addCount(Counter) {
      var $visitors = $(".leancloud_visitors");
      var url = $visitors.attr('id').trim();
      var title = $visitors.attr('data-flag-title').trim();
      var query = new AV.Query(Counter);

      query.equalTo("url", url);
      query.find({
        success: function(results) {
          if (results.length > 0) {
            var counter = results[0];
            counter.fetchWhenSave(true);
            counter.increment("time");
            counter.save(null, {
              success: function(counter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(counter.get('time'));
              },
              error: function(counter, error) {
                console.log('Failed to save Visitor num, with error message: ' + error.message);
              }
            });
          } else {
            var newcounter = new Counter();
            /* Set ACL */
            var acl = new AV.ACL();
            acl.setPublicReadAccess(true);
            acl.setPublicWriteAccess(true);
            newcounter.setACL(acl);
            /* End Set ACL */
            newcounter.set("title", title);
            newcounter.set("url", url);
            newcounter.set("time", 1);
            newcounter.save(null, {
              success: function(newcounter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(newcounter.get('time'));
              },
              error: function(newcounter, error) {
                console.log('Failed to create');
              }
            });
          }
        },
        error: function(error) {
          console.log('Error:' + error.code + " " + error.message);
        }
      });
    }

    $(function() {
      var Counter = AV.Object.extend("Counter");
      if ($('.leancloud_visitors').length == 1) {
        addCount(Counter);
      } else if ($('.post-title-link').length > 1) {
        showTime(Counter);
      }
    });
  </script>



  
<script type="text/javascript" async src="//push.zhanzhang.baidu.com/push.js">
</script>


</body>
</html>
